---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemIsCoreLayer
source: html/8916fb97-6c59-f72f-3655-5dcd702eb951.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemIsCoreLayer Property

"Is Core Layer"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemIsCoreLayer { get; }
```